### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [548]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Desktop/homework/Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
df = pd.read_csv(file_to_load)

df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count solved

* Display the total number of players

In [549]:
total_players = df['SN'].count()
total_players

780

## Purchasing Analysis (Total)solved

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [550]:
heroes_formatted = df[["Purchase ID", "SN", "Age", "Gender", "Item ID", "Item Name", "Price"]]
heroes_formatted.head(1)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53

In [551]:


total_revenue = heroes_formatted["Price"].sum()
average_price = heroes_formatted["Price"].mean()
unique_items = heroes_formatted["Item Name"].unique().tolist()
unique_items_count = len(unique_items)

heroes_formatted["Number of Unique Items"] = unique_items_count
heroes_formatted["Average Price"] = average_price
heroes_formatted["Number of Purchases"] = total_players
heroes_formatted["Total Revenue"] = total_revenue
#heroes_formatted.drop[("Purchase ID", "SN", "Age", "Gender", "Item ID", "Item Name", "Price")]

df5 = pd.DataFrame({'Number of Unique Items': [unique_items_count], 'Average Price' : [average_price], 'Number of Purchases' : total_players, 'Total Revenue' : [total_revenue]})

df5["Average Price"] = df5["Average Price"].map("${:.2f}".format)
df5["Total Revenue"] = df5["Total Revenue"].map("${:,.2f}".format)

df5.head()

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics solved

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [552]:
df7 = df.drop_duplicates(['SN'], keep='first')

df7.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [553]:
#duplicated values
dup_males = len(heroes_formatted.loc[heroes_formatted.Gender == "Male"])
dup_females = len(heroes_formatted.loc[heroes_formatted.Gender == "Female"])
dup_others = len(heroes_formatted.loc[heroes_formatted.Gender == "Other / Non-Disclosed"])
#non-duplicated values
number_males = len(df7.loc[df7.Gender == "Male"])
number_females = len(df7.loc[df7.Gender == "Female"])
number_others = len(df7.loc[df7.Gender == "Other / Non-Disclosed"])
total_male_count = round((dup_males)/total_players*100, 2)
total_female_count = round((dup_females)/total_players*100, 2)
total_others_count = round((dup_others)/total_players*100, 2)
order_of=('Male', 'Female', 'Other / Non-Disclosed')

df2 = pd.DataFrame({'Total count': [number_males, number_females, number_others], 
                    'Percentage of Players' : [total_male_count, total_female_count, total_others_count]}, index=list(order_of))
df2

                       Total count  Percentage of Players
Male                           484                  83.59
Female                          81                  14.49
Other / Non-Disclosed           11                   1.92

In [4]:
[total_purchase_val_male, total_purchase_val_female, total_purchase_val_others]

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [565]:
total_per_person_male = round(total_revenue/dup_males, 2)
total_per_person_female = round(total_revenue/dup_females, 2)
total_per_person_others = round(total_revenue/dup_others, 2)
#total purchase value
total_purchase_val_male = round(dup_males*total_per_person_male, 2)
total_purchase_val_female = round(dup_females*total_per_person_female, 2)
total_purchase_val_others = round(dup_others*total_per_person_others, 2)
#average per person
average_purchase_male = round(total_purchase_val_male/total_players, 2)
average_purchase_female = round(total_purchase_val_female/total_players, 2)
average_purchase_others = round(total_purchase_val_others/total_players, 2)

In [570]:
gender_count = df["Gender"].value_counts()
test_fun = df.groupby("Gender")["Price"].sum()
test_count = df.groupby("Gender")["Purchase ID"].count()
test_average = df.groupby("Gender")["Price"].mean()
test_per_person = df.groupby("SN")["Price"].sum()
#test_sn = df.groupby("Gender")["Female"].count()
test_round = round(test_average, 2)
test_per_gender = test_average/test_count*100
print(count)
#flipp_me = pd.DataFrame([test_fun, test_count, test_average])

dftest = pd.DataFrame(pd.concat([test_count, test_round, test_fun], axis = 1))
dftest

renamed_df = dftest.rename(columns={"Purchase ID":"Purchase Count", "Price":"Average Purchase Price", "Price":"Total Purchase Value"})
renamed_df.head()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

,Purchase Count,Total Purchase Value,Total Purchase Value
Gender,,,
Female,113,3.20,361.94
Male,652,3.02,1967.64
Other / Non-Disclosed,15,3.35,50.19

In [566]:
df3 = pd.DataFrame({'Purchase Count' : [dup_males, dup_females, dup_others],
                   'Average Purchase Price' : [total_per_person_male, total_per_person_female, total_per_person_others], 
                    'Total Purchase Value' :  [total_purchase_val_male, total_purchase_val_female, total_purchase_val_others], 
                    'Avg Total Purchase per Person' : [average_purchase_male, average_purchase_female, average_purchase_others]}, index = list(order_of))
df3

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Male,652,3.65,2379.80,3.05
Female,113,21.06,2379.78,3.05
Other / Non-Disclosed,15,158.65,2379.75,3.05

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics  solved

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [428]:
bins = [0, 10, 15, 20, 25, 30, 35, 40, 45, 50]
# Create labels for these bins
group_names = ["<10", "10-14","15-19","20-24","25-29","30-34", "35-39", "40+", "45"]

In [429]:

pd.cut(df["Age"], bins, labels=group_names)
df["Age Range"] = pd.cut(df["Age"], bins, labels=group_names,)
#df.head()


# Create a GroupBy object based upon "View Group"
age_group = df.groupby("Age Range")

# Find how many rows fall into each bin
print(age_group["Age"].count())

# Get the average of each column within the GroupBy object
age_group[["Age", "Age Range"]].mean()

Age Range
<10       32
10-14     54
15-19    200
20-24    325
25-29     77
30-34     52
35-39     33
40+        7
45         0
Name: Age, dtype: int64

                 Age
Age Range
<10         8.468750
10-14      13.962963
15-19      18.695000
20-24      22.972308
25-29      28.584416
30-34      33.288462
35-39      38.030303
40+        42.857143
45               NaN

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

ValueError: can not merge DataFrame with instance of type <class 'pandas.core.groupby.groupby.DataFrameGroupBy'>

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19
<10,23,$3.35,$77.13,$4.54

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [475]:

df.columns
#df.set_index(["Purchase ID", "SN"], inplace=True)

# Collecting best close for Bitcoin and Dash
#bitcoin_close = crypto_df["Bitcoin Close"].max()
#dash_close = crypto_df["Dash Close"].max()

Index(['Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80